cases/round/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           | Copyright (C) 2016 Ehsan Madadi-Kandjani        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
/*
Working on Mesh_Buildings.obj
Bounding Box Minimum: [-1038.868757 -1022.778581    -3.910038]
Bounding Box Maximum: [1079.51713  1028.096811  150.421   ]
Working on Mesh_Terrain.obj
Bounding Box Minimum: [-4800.       -4800.          -8.210045]
Bounding Box Maximum: [4800.       4800.          9.263489]
Working on Mesh_Vegetation.obj
Bounding Box Minimum: [-3994.551754 -3992.645193    -8.41178 ]
Bounding Box Maximum: [3994.790801 3983.432221    9.23389 ]
Working on Mesh_Water.obj
Bounding Box Minimum: [-3954.624428 -3991.796701    -6.763438]
Bounding Box Maximum: [3999.081519 3999.999678    6.179676]
*/

// General macros to create cylinder mesh











// Maximum height in the domain


// Center point in X cylinder

// Center point in Y cylinder

// Define bottom height (from the terrain)


// Inner square side half //todo: rewrite

// Inner square side curvature
 //todo: try to parameterise

// Number of cells at inner square
			// Try first with 28, 38, 52
// Number of cells between inner square and circle
			// Try first with 20, 27, 38
// Number of cells in the cylinder height
			// Try first with 3, 5, 7
			// Try first with 5, 7, 9

// Define stretching



// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Calculate CFD domain extension following COST732 guidelines

// Cylinder radius


// Second part of cells in inner/outer circle



// Height of cylinder
	// Changed from 10 to 6 as per COST732
// Base z

// Mid z

// Outlet z





// 45 degree points angle





// Half of 45 degree points angle

























// Inner square x and y position
// x




// y





// Circle x and y positions
// x




// y





// Inner square x and y position middle curvatures
// x




// y





// Circle x and y positions middle curvatures
// x




// y





// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (1200 -1200 -2) // Vertex s0b = 0   //0
    (-1200 -1200 -2) // Vertex s1b = 1   //1
    (-1200 1200 -2) // Vertex s2b = 2   //2
    (1200 1200 -2) // Vertex s3b = 3   //3
    
    (3288.04653251745 -3288.04653251744 -2) // Vertex r0b = 4   //4
    (-3288.04653251744 -3288.04653251745 -2) // Vertex r1b = 5   //5
    (-3288.04653251744 3288.04653251745 -2) // Vertex r2b = 6   //6
    (3288.04653251745 3288.04653251744 -2) // Vertex r3b = 7   //7

    (1200 -1200 298) // Vertex s0m = 8   //8
    (-1200 -1200 298) // Vertex s1m = 9   //9
    (-1200 1200 298) // Vertex s2m = 10   //10
    (1200 1200 298) // Vertex s3m = 11   //11
    
    (3288.04653251745 -3288.04653251744 298) // Vertex r0m = 12   //12
    (-3288.04653251744 -3288.04653251745 298) // Vertex r1m = 13   //13
    (-3288.04653251744 3288.04653251745 298) // Vertex r2m = 14   //14
    (3288.04653251745 3288.04653251744 298) // Vertex r3m = 15   //15
    
    (1200 -1200 898) // Vertex s0t = 16   //16
    (-1200 -1200 898) // Vertex s1t = 17   //17
    (-1200 1200 898) // Vertex s2t = 18   //18
    (1200 1200 898) // Vertex s3t = 19   //19
    
    (3288.04653251745 -3288.04653251744 898) // Vertex r0t = 20   //20
    (-3288.04653251744 -3288.04653251745 898) // Vertex r1t = 21   //21
    (-3288.04653251744 3288.04653251745 898) // Vertex r2t = 22   //22
    (3288.04653251745 3288.04653251744 898) // Vertex r3t = 23   //23
);

blocks
(
    //block0
    hex (1 0 3 2 9 8 11 10)
    square
    (30 30 4)
    simpleGrading (1 1 1)
    
    //block1
    hex (0 4 7 3 8 12 15 11)
    innerCircle
    (22 30 4)
    simpleGrading (2 1 1)
    
    //block2
    hex (3 7 6 2 11 15 14 10)
    innerCircle
    (22 30 4)
    simpleGrading (2 1 1)
    
    //block3
    hex (2 6 5 1 10 14 13 9)
    innerCircle
    (22 30 4)
    simpleGrading (2 1 1)
    
    //block4
    hex (1 5 4 0 9 13 12 8)
    innerCircle
    (22 30 4)
    simpleGrading (2 1 1)

    //block01
    hex (9 8 11 10 17 16 19 18)
    square
    (30 30 4)
    simpleGrading (1 1 2)
    
    //block11
    hex (8 12 15 11 16 20 23 19)
    innerCircle
    (22 30 4)
    simpleGrading (2 1 2)
    
    //block21
    hex (11 15 14 10 19 23 22 18)
    innerCircle
    (22 30 4)
    simpleGrading (2 1 2)
    
    //block31
    hex (10 14 13 9 18 22 21 17)
    innerCircle
    (22 30 4)
    simpleGrading (2 1 2)
    
    //block41
    hex (9 13 12 8 17 21 20 16)
    innerCircle
    (22 30 4)
    simpleGrading (2 1 2)
);

edges
(
    //Circle edges
    arc 7 4 (4650 0 -2)
    arc 4 5 (2.8473038080176e-13 -4650 -2)
    arc 5 6 (-4650 5.69460761603518e-13 -2)
    arc 6 7 (2.8473038080176e-13 4650 -2)
    
    arc 15 12 (4650 0 298)
    arc 12 13 (2.8473038080176e-13 -4650 298)
    arc 13 14 (-4650 5.69460761603518e-13 298)
    arc 14 15 (2.8473038080176e-13 4650 298)

    arc 23 20 (4650 0 898)
    arc 20 21 (2.8473038080176e-13 -4650 898)
    arc 21 22 (-4650 5.69460761603518e-13 898)
    arc 22 23 (2.8473038080176e-13 4650 898)
    
    arc 3 0 (1320 0 -2)
    arc 0 1 (0 -1320 -2)
    arc 1 2 (-1320 0 -2)
    arc 2 3 (0 1320 -2)

    arc 11 8 (1320 0 298)
    arc 8 9 (0 -1320 298)
    arc 9 10 (-1320 0 298)
    arc 10 11 (0 1320 298)
    
    arc 19 16 (1320 0 898)
    arc 16 17 (0 -1320 898)
    arc 17 18 (-1320 0 898)
    arc 18 19 (0 1320 898)
);

patches
(
    patch inletOutlet
    (
        (4 7 12 15)
        (5 4 13 12)
        (6 5 14 13)
        (7 6 15 14)
        (12 15 23 20)
        (13 12 20 21)
        (14 13 21 22)
        (15 14 22 23)
    )
    
    wall Terrain
    (
        (3 0 1 2)
        (3 7 4 0)
        (2 6 7 3)
        (1 5 6 2)
        (0 4 5 1)
    )
    
    symmetry top
    (
        (19 18 17 16)
        (19 16 20 23)
        (18 19 23 22)
        (17 18 22 21)
        (16 17 21 20)
    )
);

mergePatchPairs
(
);
