cases/round/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include 	"include/ABLConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $Uvector;

boundaryField
{
    inletOutlet
    {
        type            atmBoundaryLayerInletVelocity;
	#include        "include/ABLConditions";
	z0		$z0;
        value           uniform (0 0 0);
    }

    top
    {
	type		symmetry;
    }

    "(Buildings|Terrain|Water|Vegetation|Forest|Ocean)"
    {
        type            noSlip;
    }


}

// ************************************************************************* //
