cases/round/system/fvSchemes_2ndorder
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         	cellLimited Gauss linear 1;
    limited         	cellLimited Gauss linear 1;
    grad(U)         	$limited;
    grad(k)         	$limited;
    grad(epsilon)     	$limited;
}

divSchemes
{

    default             none;
// 2nd Order Scheme
    div(phi,U)			bounded Gauss linearUpwindV limited;
    turbulence			bounded Gauss limitedLinear 1;
    div(phi,k)			$turbulence; //Gauss SFCD;        	// Gauss Minmod;
    div(phi,epsilon)		$turbulence; //Gauss SFCD;		// Gauss Minmod;
    div(phi,omega)		$turbulence; //Gauss SFCD;		// Gauss Minmod;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;

// 1st Order Scheme
/*
    div(phi,U)         bounded Gauss linearUpwindV limited;
    div(phi,k)         bounded Gauss upwind;
    div(phi,epsilon)   bounded Gauss upwind;
    div(phi,omega)     bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
*/
}

laplacianSchemes
{
//    default         Gauss linear corrected;
    default         Gauss linear limited 0.5;
}

interpolationSchemes
{
    	default         linear;
}

snGradSchemes
{
//    	default         corrected;
	default		limited 0.5;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
